app/controllers/customers_controller.rb

  def create
    @customer = Customer.new(customer_params)

    respond_to do |format|
      if @customer.save
---
INSERT INTO "customers" ("firstname", "lastname", "email", "phone", "address1", "address2", "city", "state", "zip", "addlnotes", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def destroy
    @customer.destroy
---
DELETE FROM "customers" WHERE "customers"."id" = ?  [["id", 1]]