app/controllers/prodingrediants_controller.rb

SELECT "prodingrediants".* FROM "prodingrediants"
---
  def index
    @prodingrediants = Prodingrediant.all