app/controllers/purchasedetails_controller.rb

  def index
    @purchasedetails = Purchasedetail.all
---
SELECT "purchasedetails".* FROM "purchasedetails"